mattivilola/ilo-esp32-waveshare-app/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 on Waveshare ESP32-S3-Touch-LCD-5 (SKU 28117)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB OPI PSRAM and RGB framebuffer bandwidth
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Native USB serial/JTAG is the verified development path on this board
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Exact supported board; do not select the 1024x600 _5_B variant
CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_SUPPORTED=y
CONFIG_BOARD_WAVESHARE_ESP32_S3_TOUCH_LCD_5=y
CONFIG_ESP_PANEL_DRIVERS_TOUCH_USE_GT911=y
CONFIG_ESP_PANEL_DRIVERS_TOUCH_COMPILE_UNUSED_DRIVERS=n

# TLS-PSK is the only wireless application transport in protocol v1
CONFIG_ESP_TLS_PSK_VERIFICATION=y

# UI assets used by the compact operations console
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_LOG=y

# Dual OTA slots reserve a rollback-safe update path
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
